nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1186/driver_examples/sramc/sram_controller/pin_mux.c
void BOARD_InitSramcPins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc1);
    /* D0 - D7 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_00_AHB_SRAMC_DATA00, /* GPIO_EMC_B1_00 is configured as AHB_SRAMC_DATA00 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_01_AHB_SRAMC_DATA01, /* GPIO_EMC_B1_01 is configured as AHB_SRAMC_DATA01 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_02_AHB_SRAMC_DATA02, /* GPIO_EMC_B1_02 is configured as AHB_SRAMC_DATA02 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_03_AHB_SRAMC_DATA03, /* GPIO_EMC_B1_03 is configured as AHB_SRAMC_DATA03 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_04_AHB_SRAMC_DATA04, /* GPIO_EMC_B1_04 is configured as AHB_SRAMC_DATA04 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_05_AHB_SRAMC_DATA05, /* GPIO_EMC_B1_05 is configured as AHB_SRAMC_DATA05 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_06_AHB_SRAMC_DATA06, /* GPIO_EMC_B1_06 is configured as AHB_SRAMC_DATA06 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_07_AHB_SRAMC_DATA07, /* GPIO_EMC_B1_07 is configured as AHB_SRAMC_DATA07 */
                     0U);
    /* D8 - D15 (Needed for 16-bit mode) */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_30_AHB_SRAMC_DATA08, /* GPIO_EMC_B1_30 is configured as AHB_SRAMC_DATA08 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_31_AHB_SRAMC_DATA09, /* GPIO_EMC_B1_31 is configured as AHB_SRAMC_DATA09 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_32_AHB_SRAMC_DATA10, /* GPIO_EMC_B1_32 is configured as AHB_SRAMC_DATA10 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_33_AHB_SRAMC_DATA11, /* GPIO_EMC_B1_33 is configured as AHB_SRAMC_DATA11 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_34_AHB_SRAMC_DATA12, /* GPIO_EMC_B1_34 is configured as AHB_SRAMC_DATA12 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_35_AHB_SRAMC_DATA13, /* GPIO_EMC_B1_35 is configured as AHB_SRAMC_DATA13 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_36_AHB_SRAMC_DATA14, /* GPIO_EMC_B1_36 is configured as AHB_SRAMC_DATA14 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_37_AHB_SRAMC_DATA15, /* GPIO_EMC_B1_37 is configured as AHB_SRAMC_DATA15 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    /* Write Enable (WE) */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_26_AHB_SRAMC_WE, /* GPIO_EMC_B1_26 is configured as AHB_SRAMC_WE */
                     0U);
    /* Output Enable (OEB) */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_27_AHB_SRAMC_OEB, /* GPIO_EMC_B1_27 is configured as AHB_SRAMC_OEB */
                     0U);
    /* Address Valid (ADV#) - Needed for ADMUX mode */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_28_AHB_SRAMC_ADV, /* GPIO_EMC_B1_28 is configured as AHB_SRAMC_ADV */
                     0U);
    /* chip select*/
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_29_AHB_SRAMC_CS0,       /* GPIO_EMC_B1_29 is configured as AHB_SRAMC_CS0 */
                     0U);
    /* D0 - D7 */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_01_AHB_SRAMC_DATA01, /* GPIO_EMC_B1_01 PAD functional properties : */
                        0x0AU);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PD
                                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_02_AHB_SRAMC_DATA02, /* GPIO_EMC_B1_02 PAD functional properties : */
                        0x0AU);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PD
                                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_03_AHB_SRAMC_DATA03, /* GPIO_EMC_B1_03 PAD functional properties : */
                        0x0AU);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PD
                                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_04_AHB_SRAMC_DATA04, /* GPIO_EMC_B1_04 PAD functional properties : */
                        0x0AU);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PD
                                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_05_AHB_SRAMC_DATA05, /* GPIO_EMC_B1_05 PAD functional properties : */
                        0x0AU);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PD
                                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_06_AHB_SRAMC_DATA06, /* GPIO_EMC_B1_06 PAD functional properties : */
                        0x0AU);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PD
                                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_07_AHB_SRAMC_DATA07, /* GPIO_EMC_B1_07 PAD functional properties : */
                        0x0AU);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PD
                                                                   Open Drain Field: Disabled */
    /* D8 - D15 (Needed for 16-bit mode) */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_30_AHB_SRAMC_DATA08, /* GPIO_EMC_B1_30 PAD functional properties : */
                        0x0AU);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PD
                                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_31_AHB_SRAMC_DATA09, /* GPIO_EMC_B1_31 PAD functional properties : */
                        0x0AU);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PD
                                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_32_AHB_SRAMC_DATA10, /* GPIO_EMC_B1_32 PAD functional properties : */
                        0x0AU);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PD
                                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_33_AHB_SRAMC_DATA11, /* GPIO_EMC_B1_33 PAD functional properties : */
                        0x0AU);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PD
                                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_34_AHB_SRAMC_DATA12, /* GPIO_EMC_B1_34 PAD functional properties : */
                        0x0AU);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PD
                                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_35_AHB_SRAMC_DATA13, /* GPIO_EMC_B1_35 PAD functional properties : */
                        0x0AU);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PD
                                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_36_AHB_SRAMC_DATA14, /* GPIO_EMC_B1_36 PAD functional properties : */
                        0x0AU);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PD
                                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_37_AHB_SRAMC_DATA15, /* GPIO_EMC_B1_37 PAD functional properties : */
                        0x0AU);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PD
                                                                   Open Drain Field: Disabled */
    /* Write Enable (WE) */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_26_AHB_SRAMC_WE,     /* GPIO_EMC_B1_26 PAD functional properties : */
                        0x06U);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PU
                                                                   Open Drain Field: Disabled */
    /* Output Enable (OEB) */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_27_AHB_SRAMC_OEB,    /* GPIO_EMC_B1_27 PAD functional properties : */
                        0x06U);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PU
                                                                   Open Drain Field: Disabled */
    /* Address Valid (ADV#) - Needed for ADMUX mode */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_28_AHB_SRAMC_ADV,    /* GPIO_EMC_B1_28 PAD functional properties : */
                        0x06U);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PU
                                                                   Open Drain Field: Disabled */
    /* chip select*/
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_29_AHB_SRAMC_CS0,    /* GPIO_EMC_B1_29 PAD functional properties : */
                        0x06U);                                 /* PDRV Field: normal driver
                                                                   Pull Down Pull Up Field: PU
                                                                   Open Drain Field: Disabled */
}

 
 /***********************************************************************************************************************
  * EOF
  **********************************************************************************************************************/
 